---
type: RebarHandlesData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 8
tags: [revit-api, class]
---

# RebarHandlesData

`Autodesk.Revit.DB.Structure.RebarHandlesData` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddCustomHandle | 2018 | `public void AddCustomHandle ( int customHandleTag )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCustomHandles | 2018 | `public IList < int > GetCustomHandles ()` |
| Method | GetEndHandle | 2018 | `public int GetEndHandle ()` |
| Method | GetStartHandle | 2018 | `public int GetStartHandle ()` |
| Method | SetEndHandle | 2018 | `public void SetEndHandle ( int endHandleTag )` |
| Method | SetStartHandle | 2018 | `public void SetStartHandle ( int startHandleTag )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |